app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."user_id" = $1  [["user_id", 1]]
---
  def index
    @shows = Show.where(:user_id=> current_user.id)

INSERT INTO "shows" ("title", "genre", "description", "release_date", "episodes", "rss", "site", "voice_artist_string", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @show = current_user.shows.build(show_params)
    if @show.save

UPDATE "shows" SET "title" = $1, "genre" = $2, "description" = $3, "release_date" = $4, "rss" = $5, "site" = $6, "voice_artist_string" = $7, "updated_at" = $8 WHERE "shows"."id" = $9  [["title", nil], ["genre", "2"], ["description", nil], ["release_date", nil], ["rss", nil], ["site", nil], ["voice_artist_string", nil], ["updated_at", "2016-12-01 11:54:45.325850"], ["id", 39]]
---
  def update
    # @show = Show.find(params[:id])
    # render json: @show
    if @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = $1  [["id", 29]]
---
  def destroy
    if @show.destroy

SELECT  "shows".* FROM "shows" WHERE "shows"."user_id" = $1 AND "shows"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 11]]
---
  def set_show
    @show = current_user.shows.find(params[:id])